Vamshi-Mohan1/STM32_Project/10_ADC_DMA/Src/adc.c
/*
 * adc.c
 *
 *  Created on: Jun 24, 2025
 *      Author: Vamshi
 */



//Note the ADC1 module is connected to AHB2 bus.

#include "stm32l4xx_hal.h"
#include "adc.h"

extern ADC_HandleTypeDef hadc1;
//static void adc_cont_conv_init(void);//for pc0

uint32_t pc0_adc_read(void)
{
	return HAL_ADC_GetValue(&hadc1);//(hadc)
}
void adc_init_start(void)
{
	adc_cont_conv_init();
	HAL_ADC_Start(&hadc1);//(hadc)
}
//Bus connected to adc1 is AHP2 80 Mhz
//pin is usind PC0 which have ADC1_1 channel.
void adc_cont_conv_init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};
	ADC_ChannelConfTypeDef sConfig ={0};
	//ADC_InitTypeDef


	//configure pc0 as analog pin
		__HAL_RCC_GPIOC_CLK_ENABLE();


		GPIO_InitStruct.Pin = GPIO_PIN_0;
		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pull = GPIO_NOPULL;

		HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
	//config adc modle for ontinuous conversation

		__HAL_RCC_ADC_CLK_ENABLE();

		hadc1.Instance = ADC1;
		hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
		hadc1.Init.Resolution = ADC_RESOLUTION_12B;
		hadc1.Init.ContinuousConvMode = ENABLE;
		hadc1.Init.DiscontinuousConvMode = DISABLE;
		hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
		hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
		hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
		hadc1.Init.NbrOfConversion = 1;
		hadc1.Init.DMAContinuousRequests = DISABLE;
		hadc1.Init.EOCSelection = ADC_EOC_SEQ_CONV;


		HAL_ADC_Init(&hadc1);

		HAL_ADC_Init(&hadc1);

				sConfig.Channel = ADC_CHANNEL_1;
				sConfig.Rank = 1;
				sConfig.SamplingTime = ADC_SAMPLETIME_12CYCLES_5;
				HAL_ADC_ConfigChannel(&hadc1, &sConfig);
}

void adc_single_conv_init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};
	ADC_ChannelConfTypeDef sConfig ={0};
	//ADC_InitTypeDef


	//configure pc0 as analog pin
		__HAL_RCC_GPIOC_CLK_ENABLE();


		GPIO_InitStruct.Pin = GPIO_PIN_0;
		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pull = GPIO_NOPULL;

		HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
	//config adc modle for ontinuous conversation
		__HAL_RCC_ADC1_CLK_ENABLE();


		hadc1.Instance = ADC1;
		hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
		hadc1.Init.Resolution = ADC_RESOLUTION_12B;
		hadc1.Init.ContinuousConvMode = DISABLE;
		hadc1.Init.DiscontinuousConvMode = DISABLE;
		hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
		hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
		hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
		hadc1.Init.NbrOfConversion = 1;
		hadc1.Init.DMAContinuousRequests = DISABLE;
		hadc1.Init.EOCSelection = ADC_EOC_SEQ_CONV;


		HAL_ADC_Init(&hadc1);

		sConfig.Channel = ADC_CHANNEL_1;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_12CYCLES_5;
		HAL_ADC_ConfigChannel(&hadc1, &sConfig);
}

//============Interrupt=============================

void adc_interrupt_conv_init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};
	ADC_ChannelConfTypeDef sConfig ={0};
	//ADC_InitTypeDef


	//configure pc0 as analog pin
		__HAL_RCC_GPIOC_CLK_ENABLE();


		GPIO_InitStruct.Pin = GPIO_PIN_0;
		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pull = GPIO_NOPULL;

		HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
	//config adc modle for ontinuous conversation
		__HAL_RCC_ADC_CLK_ENABLE();


		hadc1.Instance = ADC1;
		hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
		hadc1.Init.Resolution = ADC_RESOLUTION_12B;
		hadc1.Init.ContinuousConvMode = DISABLE;
		hadc1.Init.DiscontinuousConvMode = DISABLE;
		hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
		hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
		hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
		hadc1.Init.NbrOfConversion = 1;
		hadc1.Init.DMAContinuousRequests = DISABLE;
		hadc1.Init.EOCSelection = ADC_EOC_SEQ_CONV;


		HAL_ADC_Init(&hadc1);

		sConfig.Channel = ADC_CHANNEL_1;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_12CYCLES_5;
		HAL_ADC_ConfigChannel(&hadc1, &sConfig);

		NVIC_SetPriority(ADC1_IRQn,0);
		NVIC_EnableIRQ(ADC1_IRQn);
}


void ADC_IRQHandler(void)
{
	HAL_ADC_IRQHandler(&hadc1);
}
